import Pagetitle from "@/components/(home)/shared/pagetitle";
import React from "react";

const Privacy = () => {
  return (
    <div>
      <Pagetitle
        pageName="প্রাইভেসি পলিসি"
        pagePragraph=""
        pageTitle="প্রাইভেসি পলিসি"
      />

      <div className="container mx-auto px-4 py-8">
        <div className="prose max-w-none">
          <h2 className="text-xl font-semibold mb-4 mt-10">
            প্রাইভেসি পলিসি :
          </h2>

          <p>
            ICTBangla লিমিটেড (কোম্পানি রেজিস্ট্রেশন নম্বর …………), যা ১৯৯৪ সালের
            বাংলাদেশী কোম্পানি আইন (অ্যাক্ট XVIII) এর অধীনে নিবন্ধিত (এরপর
            &apos;&apos;কোম্পানি&apos;&apos; হিসেবে উল্লিখিত), আপনার ব্যক্তিগত
            তথ্যের সুরক্ষায় প্রতিশ্রুতিবদ্ধ। আমাদের সেবাগুলি আপনাকে সঠিকভাবে
            পৌঁছে দিতে, আমরা আপনার কিছু তথ্য সংগ্রহ করতে পারি এবং কখনও কখনও তা
            অন্যদের সাথে শেয়ারও করতে পারি। আপনার প্রাইভেসি নিশ্চিত করতে, আমরা
            এই নীতিমালা তৈরি করেছি যেখানে তথ্য সংগ্রহ ও ব্যবহারের পদ্ধতি এবং
            আপনার অধিকার সম্পর্কে বিস্তারিত জানানো হয়েছে।
          </p>

          <p>
            আমাদের ওয়েবসাইট, https://www.ictbangla.com/ (এরপর
            &apos;&apos;ওয়েবসাইট&apos;&apos;) ব্যবহার করার আগে এই প্রাইভেসি
            পলিসিটি ভালোভাবে পড়ার জন্য আপনাকে অনুরোধ করা হচ্ছে। ওয়েবসাইট বা
            অ্যাপ্লিকেশনে লগইন করার মাধ্যমে আপনি এই নীতিমালায় বর্ণিত শর্তাবলি
            মেনে নিতে সম্মত হচ্ছেন। যদি আপনি আমাদের এই গোপনীয়তা নীতিতে (যা
            আপনার ব্যক্তিগত তথ্য সংগ্রহ ও ব্যবহারকে কভার করে) সম্মত না হন, তাহলে
            আপনি ওয়েবসাইট বা অ্যাপ্লিকেশন ব্যবহার করতে পারবেন না।
          </p>

          <p>
            এই প্রাইভেসি পলিসি সম্পর্কে আপনার কোনো প্রশ্ন বা অভিযোগ থাকলে,
            অনুগ্রহ করে আমাদের কাস্টমার সাপোর্টে support@ictbangla.com ঠিকানায়
            যোগাযোগ করুন।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">১. সংজ্ঞা</h3>

          <p>
            &apos;&apos;আমরা&apos;&apos;, &apos;&apos;আমাদের&apos;&apos; - এই
            গোপনীয়তা নীতি যারা তৈরি করেছে, তাদের বোঝায়।
          </p>

          <p>
            &apos;&apos;আপনি&apos;&apos;, &apos;&apos;আপনার&apos;&apos; -
            ওয়েবসাইট ব্যবহারকারী প্রাকৃতিক ও আইনি ব্যক্তি উভয়কেই বোঝায়।
          </p>

          <p>
            &apos;&apos;ওয়েবসাইট&apos;&apos; - ICTBangla লিমিটেড দ্বারা তৈরি
            ICTBangla এর অফিসিয়াল ওয়েবসাইটকে বোঝায়।
          </p>

          <p>
            &apos;&apos;ব্যক্তিগত তথ্য&apos;&apos; - আপনার ব্যক্তিগতভাবে
            সনাক্তকরণযোগ্য যেকোনো তথ্য যা আমরা আপনার কাছ থেকে সংগ্রহ করতে পারি।
          </p>

          <p>
            &apos;&apos;তৃতীয় পক্ষ&apos;&apos; - ব্যবহারকারী এবং ওয়েবসাইট
            নির্মাতা ছাড়া অন্য যেকোনো ওয়েবসাইট, কোম্পানি বা ব্যক্তিকে বোঝায়।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ২. সংক্ষিপ্ত বিবরণ
          </h3>

          <p>
            আমরা অনলাইনে আপনার ব্যক্তিগত তথ্যের প্রতি শ্রদ্ধাশীল। আমরা এও
            স্বীকার করি যে, আপনার দেওয়া ব্যক্তিগতভাবে সনাক্তকরণযোগ্য তথ্য
            (&apos;&apos;ব্যক্তিগত তথ্য&apos;&apos;) সংরক্ষণ ও সঠিকভাবে ব্যবহার
            করা প্রয়োজন। আপনার সম্পর্কে যে তথ্যগুলোকে আমরা ব্যক্তিগত বলে মনে
            করি তার মধ্যে আপনার নাম, ঠিকানা, ই-মেইল ঠিকানা, ফোন নম্বর বা
            অন্যান্য যোগাযোগের বিবরণ অন্তর্ভুক্ত, তবে এগুলোর মধ্যেই সীমাবদ্ধ
            নয়।
          </p>

          <p>
            আমাদের ওয়েবসাইট বা অ্যাপ্লিকেশন থেকে কোনো পণ্য কিনতে হলে আপনাকে
            নির্দিষ্ট কিছু তথ্য দিতে হবে, যার মধ্যে রয়েছে: ফোন নম্বর; ব্যাংক
            তথ্য; জন্ম তারিখ; শ্রেণী, স্কুল, বিষয় এবং পাঠ্যক্রম; ই-মেইল ঠিকানা।
            এই গোপনীয়তা নীতিটি সেইসব ব্যবহারকারীদের কাছ থেকে সংগৃহীত তথ্যের
            ক্ষেত্রেও প্রযোজ্য যারা সদস্য হিসেবে নিবন্ধিত নন, যেমন তাদের
            ব্রাউজিং হিস্টোরি।
          </p>

          <p>
            এছাড়াও, ওয়েবসাইট এবং অ্যাপ আপনার ICTBangla অ্যাকাউন্টকে আপনার
            সোশ্যাল অ্যাকাউন্টের সাথে লিঙ্ক করার অনুমতি চায়। যদি আপনি
            অ্যাকাউন্টগুলো লিঙ্ক করার অনুমতি দিয়ে থাকেন, তাহলে তথ্য সরাসরি
            আপনার সোশ্যাল মিডিয়া অ্যাকাউন্ট থেকে সংগ্রহ করা হবে।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ৩. ব্যবহারকারী প্রদত্ত তথ্য
          </h3>
          <p>
            আপনি যখন অ্যাপ্লিকেশন/ওয়েবসাইট/সেবা/পণ্য ডাউনলোড করেন এবং সেগুলোর
            জন্য নিবন্ধন করেন, তখন এই প্ল্যাটফর্ম আপনার দেওয়া তথ্য সংগ্রহ করে।
            আমাদের কাছে নিবন্ধন করার সময় আপনি সাধারণত যা যা তথ্য দেন তার মধ্যে
            রয়েছে:
          </p>

          <p>
            আপনার নাম, বয়স, ই-মেইল ঠিকানা, ঠিকানা, ফোন নম্বর, পাসওয়ার্ড এবং
            আপনার পড়াশোনার আগ্রহ।
          </p>

          <p>
            পেমেন্ট করার সময় বা অফার গ্রহণ করার সময় বা আমাদের অ্যাপ্লিকেশন
            ডাউনলোড বা ব্যবহার করার সময় লেনদেন-সম্পর্কিত তথ্য।
          </p>

          <p>সহায়তার জন্য আমাদের সাথে যোগাযোগ করার সময় আপনার দেওয়া তথ্য।</p>

          <p>
            অ্যাপ্লিকেশন/সেবা/পণ্য ব্যবহার করার সময় আপনি আমাদের সিস্টেমে যে
            তথ্য দেন, যেমন প্রশ্ন জিজ্ঞাসা করার সময়, আলোচনায় অংশ নেওয়ার সময়
            এবং পরীক্ষা দেওয়ার সময়।
          </p>

          <p>
            এই তথ্যগুলো &apos;&apos;ব্যক্তিগত তথ্য&apos;&apos; হিসেবে বিবেচিত
            হবে। আপনাকে সেবা, গুরুত্বপূর্ণ তথ্য, প্রয়োজনীয় নোটিফিকেশন এবং
            মার্কেটিং প্রচারণার জন্য আমরা এই তথ্যগুলো সময় সময় ব্যবহার করতে
            পারি। যদি আমাদের অতিরিক্ত এমন তথ্যের প্রয়োজন হয় যা আপনাকে
            ব্যক্তিগতভাবে শনাক্ত করবে, তবে আমরা আপনার অনুমতি চাওয়া হবে।
          </p>

          <p>
            যেসব ব্যবহারকারী একই ডিভাইস ব্যবহার করে আমাদের অ্যাপ, ওয়েবসাইট বা
            সেবা/পণ্য অ্যাক্সেস করেন, আমরা তাদের মধ্যে পার্থক্য করব না, যদি
            তাদের লগইন/অ্যাক্সেস ক্রেডেনশিয়ালগুলো মিলে যায়।
            অ্যাপ/ওয়েবসাইট/সেবা/পণ্যের সম্পূর্ণ ব্যবহার করতে এবং আপনার তথ্য
            সঠিকভাবে ক্যাপচার করতে আপনার নিজস্ব ক্রেডেনশিয়াল ব্যবহার করে লগইন
            করা জরুরি।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ৪. স্বয়ংক্রিয়ভাবে সংগৃহীত তথ্য
          </h3>

          <p>
            এছাড়াও, অ্যাপ/পণ্য/ডিভাইস স্বয়ংক্রিয়ভাবে কিছু তথ্য সংগ্রহ করতে
            পারে, যার মধ্যে আপনি যে ধরনের মোবাইল ডিভাইস ব্যবহার করেন, আপনার
            মোবাইল ডিভাইসের ইউনিক ডিভাইস আইডি, আপনার মোবাইল অপারেটিং সিস্টেমের
            আইপি ঠিকানা, আপনার মোবাইল ব্রাউজারের ধরন এবং
            অ্যাপ্লিকেশন/সেবা/পণ্যের ব্যবহারের তথ্য অন্তর্ভুক্ত, তবে এগুলোর
            মধ্যেই সীমাবদ্ধ নয়। অন্যান্য বেশিরভাগ মোবাইল অ্যাপ্লিকেশনের মতোই,
            আপনি যে অনুমতিগুলো দেন সে অনুযায়ী আমরা অন্যান্য প্রাসঙ্গিক তথ্য
            সংগ্রহ করি।
          </p>

          <p>
            পণ্য ও সেবার পেমেন্টের জন্য আমরা একটি বাহ্যিক ক্রেডিট কার্ড প্রসেসিং
            এবং পেমেন্ট গেটওয়ে কোম্পানি ব্যবহার করি। এই কোম্পানিগুলো আপনার
            ব্যক্তিগত তথ্য অন্য কোনো উদ্দেশ্যে সংরক্ষণ, শেয়ার, বা ব্যবহার করে
            না।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ৫. তথ্য কিভাবে সংগ্রহ করা হয়
          </h3>

          <p>
            আমরা ব্যক্তিগত তথ্য সংগ্রহ করার আগে বা সে সময়ে তথ্য সংগ্রহের
            উদ্দেশ্য নির্ধারণ করব। উপযুক্ত ব্যক্তির সম্মতি বা আইনি বাধ্যবাধকতা
            না থাকলে, আমরা শুধুমাত্র আমাদের নির্দিষ্ট উদ্দেশ্য এবং অন্যান্য
            সামঞ্জস্যপূর্ণ উদ্দেশ্যে ব্যক্তিগত ডেটা সংগ্রহ ও ব্যবহার করি। এই
            উদ্দেশ্যগুলোর জন্য, আমরা ব্যক্তিগত তথ্য শুধুমাত্র প্রয়োজনীয় সময়ের
            জন্য সংরক্ষণ করব। উপযুক্ত ব্যক্তির জ্ঞান বা সম্মতি নিয়ে, আমরা
            আইনসম্মত এবং ন্যায্য উপায়ে ব্যক্তিগত তথ্য সংগ্রহ করি। ব্যক্তিগত
            ডেটা যে উদ্দেশ্যে ব্যবহার করা হয় তার জন্য উপযুক্ত হবে এবং সেগুলোর
            প্রয়োজনে নির্ভুল, সম্পূর্ণ এবং আপডেটেড থাকবে।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">৬. কুকিজ</h3>

          <p>
            আমাদের ওয়েবসাইট এবং অ্যাপ্লিকেশনের নির্দিষ্ট কিছু পৃষ্ঠায় আমরা
            &apos;&apos;কুকিজ&apos;&apos; এর মতো ডেটা সংগ্রহের ডিভাইস ব্যবহার
            করি। &apos;&apos;কুকিজ&apos;&apos; হলো আপনার হার্ড ডিস্কে থাকা ছোট
            ফাইল যা আমাদের কাস্টমাইজড সেবা প্রদান করতে সাহায্য করে। আমরা এমন
            কিছু কার্যকারিতাও অফার করি যা শুধুমাত্র কুকিজ ব্যবহার করে ব্যবহার
            করা যেতে পারে। কুকিজ আপনার আগ্রহ-ভিত্তিক তথ্য প্রদানেও সহায়তা করতে
            পারে। নিবন্ধিত বা লগইন করা ব্যবহারকারীদের সনাক্ত করতে কুকিজ ব্যবহার
            করা যেতে পারে।
          </p>

          <p>
            এই ওয়েব পেজে আপনার পরিদর্শনের মাধ্যমে, তৃতীয় পক্ষের প্রদানকারীরা,
            যেমন Google.com (&apos;&apos;গুগল&apos;&apos;), বিজ্ঞাপন পরিবেশনের
            জন্য কুকিজ ব্যবহার করতে পারে। আপনি যদি কোনো তৃতীয় পক্ষ এমন বিকল্প
            সরবরাহ করে, তবে তাদের ওয়েবসাইট ভিজিট করে সুদ-ভিত্তিক বিজ্ঞাপনের
            জন্য কুকিজ ব্যবহার না করার বিকল্পটি বেছে নিতে পারেন।
            &apos;&apos;বিজ্ঞাপন সেটিংস&apos;&apos; ভিজিট করে আপনি গুগল এবং তার
            অংশীদারদের জন্য DoubleClick কুকিজ গ্রহণ করা থেকে অপ্ট-আউট করতে
            পারেন। (বিকল্পভাবে, aboutads.info ভিজিট করে আপনি ব্যবহারকারীদেরকে
            সুদ-ভিত্তিক বিজ্ঞাপনের জন্য তৃতীয় পক্ষের প্রদানকারীদের কুকিজ
            ব্যবহার না করার নির্দেশ দিতে পারেন)। Google Analytics এর জন্য
            অপ্ট-আউট প্লাগইন ডাউনলোড এবং ইন্সটল করে আপনি এখানে অপ্ট আউট করতে
            পারেন: https://tools.google.com/dlpage/gaoptout/
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ৭. ওয়েবসাইটে বাহ্যিক লিঙ্ক
          </h3>

          <p>
            এই ওয়েবসাইটে অন্যান্য ওয়েবসাইট, কন্টেন্ট বা রিসোর্সের হাইপারলিঙ্ক
            অন্তর্ভুক্ত থাকতে পারে। আমাদের ছাড়া অন্য কোনো কোম্পানি বা ব্যক্তি
            দ্বারা সরবরাহ করা কোনো ওয়েবসাইট বা রিসোর্স আমাদের নিয়ন্ত্রণে নেই।
            আপনি স্বীকার করেন এবং সম্মত হন যে, আমরা কোনো বাহ্যিক ওয়েবসাইট,
            রিসোর্স বা অন্যান্য সামগ্রীর অ্যাক্সেসের জন্য দায়ী নই এবং এমন কোনো
            ওয়েবসাইট বা রিসোর্স বা অন্যান্য সামগ্রীকে সমর্থন করি না। আপনি
            স্বীকার করেন এবং সম্মত হন যে, আমরা এমন বাহ্যিক ওয়েবসাইট বা
            রিসোর্সের প্রাপ্যতার কারণে বা তার সাথে সম্পর্কিত কোনো ক্ষতি বা
            ক্ষতির জন্য দায়ী নই।
          </p>

          <p>
            সেই তৃতীয় পক্ষের পরিষেবা প্রদানকারী এবং ওয়েবসাইটগুলির নিজস্ব
            গোপনীয়তা নীতি থাকতে পারে, যা আপনার ব্যক্তিগত ডেটা সংরক্ষণ এবং
            ধারণাকে প্রভাবিত করতে পারে। একটি তৃতীয় পক্ষের ওয়েবসাইট ভিজিট করার
            সময় আপনার ব্যক্তিগত তথ্য সুরক্ষার জন্য সেই ওয়েবসাইটের গোপনীয়তা
            নীতি পর্যালোচনা করতে আমরা আপনাকে উৎসাহিত করি। আপনি যখন এই ওয়েবসাইট
            ভিজিট করেন, তখন আমরা তৃতীয় পক্ষের বিজ্ঞাপন সংস্থাগুলি ব্যবহার করি।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ৮. আপনার তথ্যের আমাদের ব্যবহার
          </h3>

          <p>
            আপনার যোগাযোগের বিবরণ প্রয়োজন অনুযায়ী আপনার সাথে যোগাযোগ করতে
            ব্যবহার করা হবে। আপনার আইপি ঠিকানা ব্যবহার করে আমরা আমাদের সার্ভারের
            সমস্যা নির্ণয় করি এবং আমাদের ওয়েবসাইট ও অ্যাপ্লিকেশন পরিচালনা করি।
            আইপি ঠিকানা দিয়ে আপনি বিস্তৃত জনসংখ্যাগত তথ্যও চিহ্নিত ও সংগ্রহ
            করতে পারবেন। অবশেষে, আপনার আইপি ঠিকানা দিয়ে আমরা আপনাকে অংশীদারিত্ব
            এবং জালিয়াতি থেকে রক্ষা করতে সাহায্য করতে পারি। নতুন প্রযুক্তির
            উপলব্ধতার সাথে সাথে আমরা নিরাপত্তা উন্নত করব।
          </p>

          <p>
            যদি আমরা অন্য কোনো কোম্পানির সাথে পুনরুদ্ধার বা একীভূত হই, তাহলে
            আপনি আমাদের সম্পর্কে তথ্য পাঠাবেন। এই ক্ষেত্রে, তথ্য স্থানান্তরের
            আগে এবং বিভিন্ন গোপনীয়তা নীতি পাওয়ার আগে, আপনাকে ই-মেইল বা সাইটে
            সুস্পষ্ট নোটিশ দেওয়ার মাধ্যমে জানানো হবে।
          </p>

          <p>
            আমরা আদালতের নির্দেশাবলী এবং অনুরূপ আইনি প্রক্রিয়ার সাথে সম্মতি
            জানাতে, অথবা আইন মেনে চলতে এবং আসন্ন শারীরিক বা অর্থের ক্ষতি এড়াতে
            প্রয়োজনীয় আন্তরিকতা প্রয়োজন বলে মনে করলে, আপনার ব্যক্তিগত তথ্য
            তৃতীয় পক্ষের কাছে প্রকাশ করতে পারি। অথবা, অবৈধ কাজ, সন্দেহজনক
            জালিয়াতি বা ব্যবহারের শর্তাবলি লঙ্ঘনের সাথে সম্পর্কিত বিষয়ে তদন্ত
            বা ব্যবস্থা নিতে পারি। আমাদের কপিরাইট নীতি অনুযায়ী, আমরা
            ব্যক্তিগতভাবে সনাক্তকরণযোগ্য তথ্য প্রকাশ করতে পারি। আপনার নাম,
            ঠিকানা, দেশ, ফোন নম্বর, ইমেল ঠিকানা এবং আপনার ব্যবসার নাম প্রকাশ
            করতে পারি।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">৯. গোপনীয়তা</h3>

          <p>
            আপনি আরও স্বীকার করেন যে এই ওয়েবসাইটে এমন ডেটা থাকতে পারে যা আমাদের
            কাছে গোপনীয়, এবং আমাদের পূর্ব লিখিত অনুমতি ছাড়া আপনি এই তথ্য
            প্রকাশ করতে পারবেন না। যদি উপযুক্ত কর্তৃপক্ষের দ্বারা আইনত প্রয়োজন
            হয়, তবে আপনার তথ্য কোনো তৃতীয় পক্ষের কাছে প্রকাশ করা হবে না। আপনার
            তথ্য গোপনীয় বলে বিবেচিত হয়। কোনো তৃতীয় পক্ষের কাছে বিক্রি, শেয়ার
            বা ভাড়া দেওয়া হবে না, এবং আমরা আপনার ইমেল ঠিকানা ব্যবহার করে
            অবাঞ্ছিত ইমেল পাঠাব না। আমরা যে ইমেল পাঠাই তা শুধুমাত্র আমাদের সম্মত
            সেবা এবং পণ্যের সাথে সম্পর্কিত।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ১০. আপনার তথ্যের আমাদের প্রকাশ
          </h3>

          <p>
            বর্তমান নিয়ন্ত্রক পরিবেশের কারণে, আমরা গ্যারান্টি দিতে পারি না যে
            আপনার ব্যক্তিগত যোগাযোগ এবং অন্যান্য তথ্য (এই গোপনীয়তা নীতিতে
            অন্যভাবে বর্ণিত না হলে) প্রকাশ করার অন্য কোনো উপায় নেই।
            উদাহরণস্বরূপ (সীমাবদ্ধ না করে), সরকার, আইন প্রয়োগকারী সংস্থা বা
            তৃতীয় পক্ষের কাছে তথ্য প্রকাশ করতে আমরা বাধ্য হতে পারি। নির্দিষ্ট
            পরিস্থিতিতে, তৃতীয় পক্ষগুলি অবৈধভাবে ট্রান্সমিশন বা ব্যক্তিগত
            যোগাযোগে হস্তক্ষেপ করতে পারে বা অ্যাক্সেস করতে পারে, অথবা সদস্যরা
            আমাদের ওয়েবসাইট থেকে সংগৃহীত আপনার তথ্য অপব্যবহার বা অপব্যবহার করতে
            পারে। অতএব, আমরা প্রতিশ্রুতি দিই না এবং আপনার ব্যক্তিগত তথ্য,
            শনাক্তকরণযোগ্য বা ব্যক্তিগত যোগাযোগ সর্বদা গোপন থাকবে বলে আশা করা
            উচিত নয়, যদিও আমরা আপনার গোপনীয়তা রক্ষা করার জন্য শিল্প-মানক
            অনুশীলন প্রয়োগ করি।
          </p>

          <p>
            নীতিগতভাবে, আমরা আপনার সম্পর্কে কোনো তৃতীয় পক্ষের কাছে তথ্য বিক্রি
            বা ভাড়া দিই না। তবে, নিম্নলিখিত কিছু উপায় বর্ণনা করা হয়েছে যেখানে
            আপনার ব্যক্তিগত তথ্য প্রকাশ করা যেতে পারে:
          </p>

          <p>
            বাহ্যিক পরিষেবা প্রদানকারী: আপনি আমাদের ওয়েবসাইটগুলি বাহ্যিক
            প্রদানকারীদের দ্বারা প্রদত্ত বিভিন্ন পরিষেবা ব্যবহার করতে পারেন।
            আপনি যখন এই ঐচ্ছিক পরিষেবাগুলি ব্যবহার করেন এবং তাদের আপনার কাছ থেকে
            ডেটা সংগ্রহ করার প্রয়োজন হয়, তখন তাদের গোপনীয়তা নীতি প্রযোজ্য
            হবে।
          </p>

          <p>
            কর্পোরেট বিশ্বের অন্যান্য সত্তা: আপনার ব্যক্তিগত তথ্য আমাদের মূল
            কোম্পানি এবং/অথবা সহযোগী সংস্থাগুলির সাথে শেয়ার করা হয় যা আপনাকে
            আপনার অনলাইন চাহিদা এবং সংশ্লিষ্ট পরিষেবাগুলিতে সহায়তা করবে, যা
            বিশ্বজুড়ে উপলব্ধ। এই বিবরণগুলি আপনাকে শুধুমাত্র আপনার ব্রাউজিং
            অভিজ্ঞতা উন্নত করতে এবং আমাদের পরিষেবাগুলি প্রদান করতে দেওয়া হবে।
            তারা আপনার তথ্যকে তাদের অন্যান্য সদস্যদের তথ্যের মতোই ব্যবহার করবে,
            যতক্ষণ না তাদের কাছে এটি অ্যাক্সেস থাকে।
          </p>

          <p>
            কোম্পানি এবং/অথবা এর সহযোগী সংস্থাগুলি, বা তাদের সকলেই অন্য একটি
            ব্যবসা সত্তা দ্বারা অর্জিত বা একীভূত হতে পারে। আপনি অর্ডার করা
            পরিষেবাগুলির সংমিশ্রণ আমাদের নিজস্ব সার্ভারে উপলব্ধ না থাকলে আমরা
            আপনার কিছু বা সমস্ত ব্যক্তিগত তথ্য শেয়ার করব। এমন কোনো ঘটনা ঘটলে
            (যে পরিমাণে এটি ঘটে), আপনাকে জানানো হবে।
          </p>

          <p>
            আইন প্রয়োগকারী এবং সরকারি কর্মকর্তা: আমরা বিভিন্ন আইন প্রয়োগকারী
            সংস্থা সহ বিভিন্ন সংস্থার সাথে কাজ করি, যার মধ্যে রয়েছে:
            বুদ্ধিবৃত্তিক সম্পত্তি, জালিয়াতি এবং অন্যান্য সম্পত্তির অধিকার।
            জালিয়াতি, বুদ্ধিবৃত্তিক বা অন্যান্য অবৈধ কার্যকলাপের তদন্তের
            ক্ষেত্রে, যা আমাদের বা আপনাকে আইনি দায়বদ্ধতার মুখে ফেলতে পারে, আপনি
            আমাদেরকে আইন প্রয়োগকারী এবং সরকারি কর্মকর্তাদের সাথে যেকোনো
            ব্যক্তিগত তথ্য শেয়ার করার অনুমতি দেন।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ১১. তথ্য দেখার অধিকার ও আপডেট
          </h3>

          <p>
            আপনি যখনই আমাদের সাইটে নিবন্ধন করবেন বা লগইন করবেন, তখন আপনার জমা
            দেওয়া তথ্য দেখতে ও আপডেট করতে পারবেন। যেমন: আপনার ঠিকানা, পোস্টকোড,
            দেশ, ফোন নম্বর ইত্যাদি সহজেই পরিবর্তন করা যাবে। যদি আপনি কোনো তথ্য
            মুছে ফেলার অনুরোধ করেন, তাহলে কিছু ক্ষেত্রে আমরা সেই তথ্যের রেকর্ড
            রাখতে পারি। বিশেষ করে যখন: কোনো আইনি সমস্যা, অভিযোগ বা বিরোধ
            নিষ্পত্তির প্রয়োজন হয়। আমাদের শর্তাবলি বা নীতিমালা বাস্তবায়নের
            প্রয়োজন হয়।
          </p>

          <p>
            মনে রাখবেন, প্রযুক্তিগত সীমাবদ্ধতার কারণে (যেমন: ব্যাকআপ সিস্টেমে
            থাকা কপি) আপনার সমস্ত তথ্য স্থায়ীভাবে মুছে ফেলা সবসময় সম্ভব নাও হতে
            পারে। তাই আপনি যদি আপনার তথ্য মুছে ফেলার অনুরোধও করেন, কিছু
            নির্দিষ্ট তথ্য আইনি ও প্রশাসনিক কারণে আমাদের সিস্টেমে সীমিত সময়ের
            জন্য থেকে যেতে পারে।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ১২. অন্যান্য তথ্য সংগ্রহকারী
          </h3>

          <p>
            এই নথিতে তথ্য শুধুমাত্র আমরা আপনার ডেটা কিভাবে সংগ্রহ করি এবং
            ব্যবহার করি তার ক্ষেত্রে প্রযোজ্য, যদি না আমাদের গোপনীয়তা নীতিতে
            অন্যথায় বলা হয়। আপনি আমাদের ছাড়া অন্য পক্ষকে যে তথ্য দেন,
            ইন্টারনেট-এ যেখানেই আপনি তাদের খুঁজে পান না কেন, সেগুলোর ব্যবহার বা
            প্রকাশের বিভিন্ন মানদণ্ড থাকতে পারে। তৃতীয় পক্ষের বিজ্ঞাপনদাতারা
            আমাদের ব্যবহারের ক্ষেত্রে তাদের নিজস্ব গোপনীয়তা নীতি মেনে চলে।
            তৃতীয় পক্ষের গোপনীয়তা নীতির উপর আমাদের কোনো নিয়ন্ত্রণ নেই, তাই
            ব্যক্তিগত তথ্য দেওয়ার আগে আপনাকে প্রশ্ন করতে হবে।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">১৩. নিরাপত্তা</h3>

          <p>
            আমরা ডেটাকে একটি মূল্যবান সম্পদ হিসেবে দেখি, এবং তাই ডেটা ক্ষতি এবং
            নিরাপত্তা লঙ্ঘন এড়াতে আমাদের যা কিছু সম্ভব তা করতে হবে। ফার্মের
            ভেতরে এবং বাইরের সদস্যদের অননুমোদিত অ্যাক্সেস থেকে তথ্য রক্ষা করতে,
            আমরা বিভিন্ন ভিন্ন নিরাপত্তা প্রযুক্তি ব্যবহার করি। আমরা এই
            ওয়েবসাইটটি ক্রেডিট কার্ডের তথ্য এবং ব্যাংক অ্যাকাউন্টের তথ্য
            অন্যান্য ব্যবহারকারীদের কাছে পাস করার জন্য ব্যবহার করার পরামর্শ দিই
            না। লোকেদেরকে এটি অফলাইনে, ফোনের মাধ্যমে বা ব্যক্তিগত ইমেলের মাধ্যমে
            করতে উৎসাহিত করা হয়। আমরা ট্রানজিট এবং ডেলিভারির পরে উভয় ক্ষেত্রেই
            স্বীকৃত শিল্প মান ব্যবহার করে আমাদের গ্রাহকদের ব্যক্তিগত তথ্যের
            গোপনীয়তা নিশ্চিত করি। যদিও অনলাইনে &apos;&apos;নিখুঁত
            নিরাপত্তা&apos;&apos; অর্জন করা সম্ভব নয়।
          </p>

          <p>
            আপনি এও স্বীকার করেন যে আমাদের স্বাভাবিক নিরাপত্তা পদ্ধতির বাইরের
            যেকোনো নিরাপত্তা ত্রুটি আপনার বহন করার ঝুঁকি।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">১৪. দাবি পরিত্যাগ</h3>

          <p>
            আপনার জানা উচিত যে, আপনার ব্যক্তিগত যোগাযোগ এবং অন্যান্য ব্যক্তিগত
            তথ্যের (যেমন আপনার ক্রেডিট কার্ড এবং ব্যাংক অ্যাকাউন্টের মতো গোপনীয়
            তথ্য) গোপনীয়তা সম্পর্কে আমাদের পক্ষে গ্যারান্টি দেওয়া সম্ভব নয়,
            কারণ এই বিষয়গুলি এমনভাবে প্রকাশ হতে পারে যা এই গোপনীয়তা নীতিতে
            বর্ণিত হয়নি। এই কারণে, যদিও আমরা আপনার গোপনীয়তা রক্ষা করার
            প্রতিশ্রুতি দিই, আমরা আপনার গোপনীয়তা সর্বদা সুরক্ষিত থাকবে তা
            নিশ্চিত করতে পারি না। এই ওয়েবসাইটের একজন ব্যবহারকারী হিসাবে, আপনি
            সচেতন এবং স্বীকার করেন যে আপনি এই ওয়েবসাইটে, ইন্টারনেটে, এবং আপনার
            নিজের ডিভাইসে, এবং অন্য যেকোনো জায়গায় আপনি যা কিছু করেন তার জন্য
            সমস্ত দায়িত্ব এবং ঝুঁকি গ্রহণ করেন।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ১৫. বিরোধ এবং বিচারিক ক্ষমতা
          </h3>

          <p>
            এই নীতি দ্বারা উত্থাপিত সমস্ত দাবি, যার মধ্যে অধিকার, ফেরত, এবং
            ক্ষতিপূরণ সংক্রান্ত দাবি অন্তর্ভুক্ত কিন্তু সীমাবদ্ধ নয়, একটি
            দ্বি-পর্যায়ের বিকল্প বিরোধ নিষ্পত্তি প্রক্রিয়া ব্যবহার করে সমাধান
            করা হবে।
          </p>

          <p>
            প্রথম ধাপ: মধ্যস্থতা (Mediation)। যদি কোনো বিরোধ দেখা দেয়, তবে একটি
            নিরপেক্ষ তৃতীয় পক্ষকে সমস্যা সমাধানের জন্য নির্বাচন করা হবে, এবং
            প্রতিটি পক্ষ পারস্পরিক চুক্তির জন্য একজন মধ্যস্থতাকারী নির্বাচন
            করবে। তারা প্রত্যেকে একজন করে একক সালিসকারী মনোনীত করতে পারে, এবং
            যদি উভয় পক্ষ সেই ব্যক্তির সাথে সম্মত হয়, তবে তাকে মামলাটি
            মধ্যস্থতা করার জন্য নিযুক্ত করা হবে। তবে, যদি প্রস্তাবিত দুই
            মধ্যস্থতাকারী একটি ঐকমত্যে পৌঁছাতে না পারে, তবে কোম্পানি চূড়ান্ত
            সিদ্ধান্ত নেওয়ার অধিকার সংরক্ষণ করে। মধ্যস্থতাকারীর সিদ্ধান্ত
            অ-বাধ্যতামূলক হওয়া সত্ত্বেও, উভয় পক্ষই তা মেনে চলার জন্য যথাসাধ্য
            চেষ্টা করবে।
          </p>

          <p>
            দ্বিতীয় ধাপ: সালিস প্রক্রিয়া (Arbitration Process)। যদি মধ্যস্থতা
            ব্যর্থ হয়, তবে সালিসকারীর সিদ্ধান্ত চূড়ান্ত এবং উভয় পক্ষের জন্য
            বাধ্যতামূলক হবে। দুটি পক্ষ প্রত্যেকে একজন করে সালিসকারী নিয়োগ করবে,
            এবং তৃতীয়জনকে তারা পারস্পরিকভাবে নির্বাচিত দুই সালিসকারী দ্বারা
            নিযুক্ত করা হবে। সালিস সভা ঢাকায়, বাংলাদেশে অনুষ্ঠিত হবে। সালিস
            প্রক্রিয়া ইংরেজিতে পরিচালিত হবে। সালিসকারী তাদের সিদ্ধান্ত ঘোষণার
            পর, উভয় পক্ষই তা মেনে চলতে বাধ্য থাকবে।
          </p>

          <p>
            যদি বিকল্প বিরোধ নিষ্পত্তি বিরোধ সমাধানে ব্যর্থ হয়, তবে মামলাটি
            ঢাকা আদালতে উত্থাপন করা হবে।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ১৬. প্রশ্ন, পরামর্শ এবং অভিযোগ কর্মকর্তা
          </h3>

          <p>
            যদি আমাদের কাস্টমার সার্ভিস টিম আপনার কোনো সমস্যা সমাধান করতে না
            পারে, অথবা আপনি কোনো অমীমাংসিত সমস্যার কথা জানাতে চান, তাহলে অনুগ্রহ
            করে আমাদের কাস্টমার সার্ভিসে support@ictbangla.com এ লিখুন।
          </p>

          <h3 className="text-lg font-semibold mt-3 mb-1">
            ১৭. শর্তাবলি এবং গোপনীয়তা নীতিতে সংশোধন ও পরিবর্তনের নোটিশ
          </h3>

          <p>
            আমরা সময়ে সময়ে প্রয়োজন মনে করলে, আপনাকে কোনো বিজ্ঞপ্তি বা পূর্ব
            নোটিশ না দিয়েই শর্তাবলি এবং গোপনীয়তা নীতি পরিবর্তন করার অধিকার
            সংরক্ষণ করি। এই ওয়েবসাইটটির আপনার চলমান ব্যবহার এই শর্তাবলি এবং
            গোপনীয়তা নীতির স্বীকৃতি হিসেবে বিবেচিত হবে। যেকোনো পরিবর্তনের
            অনুমতি আছে। ফলস্বরূপ, আপনাকে প্রায়শই সেবার শর্তাবলি পর্যালোচনা করার
            জন্য অত্যন্ত পরামর্শ দেওয়া হচ্ছে। যদি আপনি শর্তাবলির কোনো পরিবর্তন
            বা সংশোধনীর সাথে সম্মত না হন, তাহলে আপনি তাৎক্ষণিকভাবে এই ওয়েবসাইট
            এবং যেকোনো সংশ্লিষ্ট পরিষেবা ব্যবহার বন্ধ করে দিতে পারেন।
          </p>
        </div>
      </div>
    </div>
  );
};

export default Privacy;
